IDENTIFICATION DIVISION.
PROGRAM-ID. CUSTOMER-INVOICE.
AUTHOR. JANE DOE.
DATE. 2023-12-30
DATE-COMPILED. 06/30/10.
DATE-WRITTEN. 12/34/56

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT CUSTOMER-FILE ASSIGN TO 'CUSTOMER.DAT'.
    SELECT INVOICE-FILE ASSIGN TO 'INVOICE.DAT'.
    SELECT REPORT-FILE ASSIGN TO 'REPORT.TXT'.

DATA DIVISION.
FILE SECTION.
FD CUSTOMER-FILE.
01 CUSTOMER-RECORD.
   05 CUSTOMER-ID PIC 9(4).
   05 CUSTOMER-NAME PIC X(30).
   05 CUSTOMER-BALANCE PIC 9(7)V99.

FD INVOICE-FILE.
01 INVOICE-RECORD.
   05 INVOICE-ID PIC 9(4).
   05 CUSTOMER-ID PIC 9(4).
   05 INVOICE-AMOUNT PIC 9(7)V99.

FD REPORT-FILE.
01 REPORT-RECORD PIC X(80).

WORKING-STORAGE SECTION.
01 WS-CUSTOMER-FOUND PIC X(1) VALUE 'N'.
01 WS-END-OF-FILE PIC X(1) VALUE 'N'.
01 WS-TOTAL-BALANCE PIC 9(8)V99 VALUE ZERO.

PROCEDURE DIVISION.
0000-MAIN-ROUTINE.
    OPEN INPUT CUSTOMER-FILE, INVOICE-FILE
        OUTPUT REPORT-FILE.
    PERFORM 1000-PROCESS-RECORDS UNTIL WS-END-OF-FILE = 'Y'.
    CLOSE CUSTOMER-FILE, INVOICE-FILE, REPORT-FILE.
    STOP RUN.

1000-PROCESS-RECORDS.
    READ CUSTOMER-FILE
        AT END MOVE 'Y' TO WS-END-OF-FILE
        NOT AT END PERFORM 1100-UPDATE-CUSTOMER-BALANCE.
    READ INVOICE-FILE
        AT END MOVE 'Y' TO WS-END-OF-FILE.

1100-UPDATE-CUSTOMER-BALANCE.
    IF CUSTOMER-ID OF CUSTOMER-RECORD = CUSTOMER-ID OF INVOICE-RECORD
        ADD INVOICE-AMOUNT TO CUSTOMER-BALANCE OF CUSTOMER-RECORD
        WRITE REPORT-RECORD FROM CUSTOMER-RECORD
        MOVE CUSTOMER-BALANCE OF CUSTOMER-RECORD TO WS-TOTAL-BALANCE
    ELSE
        DISPLAY "CUSTOMER MISMATCH ERROR".

END PROGRAM CUSTOMER-INVOICE.